# ðŸ“Œ Pandas DataFrame Conditional Element Selection

#### Â» Importing the Pandas and Numpy libraries

In [1]:
import pandas as pd
import numpy as np

#### Â» Creating a random integer matrix with a shape

In [2]:
m = np.random.randint(5,30, size=(5,3))

#### Â» Creating a DataFrame from the matrix and naming columns

In [3]:
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])

In [4]:
df

   var1  var2  var3
0     7    11     9
1    23    12     9
2    15    14    22
3    14    29    11
4    14    24    21

#### Â» Accessing a single column with a label -> `dataframe.label`

In [5]:
df.var1

0     7
1    23
2    15
3    14
4    14
Name: var1, dtype: int64

#### Â»  Filtering column label values to access rows

In [11]:
df[df.var1 > 15]

   var1  var2  var3
1    23    12     9

In [12]:
df[df.var1 < 8]

   var1  var2  var3
0     7    11     9

In [13]:
df[df.var1 == 14]

   var1  var2  var3
3    14    29    11
4    14    24    21

In [14]:
df[df.var1 != 14]

   var1  var2  var3
0     7    11     9
1    23    12     9
2    15    14    22

In [21]:
df[(df.var1 > 15) & (df.var2 < 15)] #and

   var1  var2  var3
1    23    12     9

In [22]:
df[(df.var1 < 10) | (df.var3 > 20)] #or

   var1  var2  var3
0     7    11     9
2    15    14    22
4    14    24    21

In [23]:
df[~(df.var2 < 15)]

   var1  var2  var3
3    14    29    11
4    14    24    21

#### Â»   Filtering column label values to access rows and select only a specific column

In [17]:
df[df.var1 > 15]["var1"]

1    23
Name: var1, dtype: int64

#### Â»   Filtering column label values to access rows and select only specific columns

In [18]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
1    23    12

#### Â» Using .loc to filter with condition and select specific columns

In [19]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    23    12